fabrika/src/Documents/ТаможняРассчёты/ТаможняРассчёты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТаможняРассчёты</name>
  <registerRecords>AccumulationRegister.ТаможняОплатаГТД</registerRecords>
  <registerRecords>AccumulationRegister.ТаможняВзаимозадолженности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВБухгалтерии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорыКонтрагентов</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОплаты</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРаспределенияПлатежа</name>
    <comment>Вариант распределения платежа</comment>
    <type>
      <types>EnumRef.ВариантРаспределенияПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСрезаИнвойсов</name>
    <comment>Верхний предел подбора инвойсов</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодборГТД</name>
    <attributes>
      <name>ГТД</name>
      <type>
        <types>DocumentRef.ПриходМашины</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИнвойса</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсUSD</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсВалютыОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВалютаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доступно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодИнвойсНомер</name>
      <comment>ПодИнвойс номер</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Боркин</name>
    <comment>Приход ДС на Боркина</comment>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетОрганизации</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрихода</name>
      <comment>Плановая дата прихода</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получено</name>
      <comment>Получено</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IDстроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <comment>Валюта</comment>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fabrika/src/AccumulationRegisters/ТаможняВзаимозадолженности/ТаможняВзаимозадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТаможняВзаимозадолженности</name>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипДвижения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорыКонтрагентов</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fabrika/src/AccumulationRegisters/ТаможняОплатаГТД/ТаможняОплатаГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТаможняОплатаГТД</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипДвижения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ПриходМашины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодИнвойсНомер</name>
    <comment>ПодИнвойс номер</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fabrika/src/Enums/ВариантРаспределенияПлатежа/ВариантРаспределенияПлатежа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантРаспределенияПлатежа</name>
  <comment>Вариант распределения платежа</comment>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
  <enumValues>
    <name>ПоИнвойсу</name>
  </enumValues>
  <enumValues>
    <name>ПоДатеПлатежа</name>
  </enumValues>
</mdclass:Enum>

fabrika/src/Enums/ВидДоговораКонтрагента/ВидДоговораКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДоговораКонтрагента</name>
  <comment>Вид договора контрагента</comment>
  <enumValues>
    <name>Поставка</name>
    <comment>Договор поставки</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
    <comment>Договор комиссии</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратЗайма</name>
    <comment>ВозвратЗайма</comment>
  </enumValues>
</mdclass:Enum>

fabrika/src/Documents/ТаможняРассчёты/ObjectModule.bsl
//////////////////////////////////////ОБРАБОТКИ ПРОВЕДЕНИЯ//////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеПоРегиструТаможняВзаимозадолженности(Отказ);
	
	Если Контрагент.ВалютныйРассчёт 
		И ВариантРаспределенияПлатежа <> Перечисления.ВариантРаспределенияПлатежа.Аванс
		  И НЕ Отказ Тогда
		  ПроведениеПоРегиструТаможняОплатаГТД(Отказ);	
  	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроведениеПоРегиструТаможняВзаимозадолженности(Отказ)
	
	// регистр ТаможняВзаимозадолженности Расход
	Движения.ТаможняВзаимозадолженности.Записывать = Истина;
	Движение = Движения.ТаможняВзаимозадолженности.Добавить();
	//
	Если ДоговорыКонтрагентов.ВидДоговора <> Перечисления.ВидДоговораКонтрагента.ВозвратЗайма Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ТипДвижения = "Оплата задолженности";
	Иначе
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ТипДвижения = "Возврат";
	КонецЕсли; 
	//	
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Контрагент;
	Движение.ДоговорыКонтрагентов = ДоговорыКонтрагентов;
	
	Если Контрагент.ВалютныйРассчёт И ДоговорыКонтрагентов.Валюта.Код <> "643"  Тогда
		Движение.ВалютнаяСуммаДолга = ПодборГТД.Итог("Сумма");
		Отказ = ПроверкаРаспределения();
		
	ИначеЕсли Контрагент.ВалютныйРассчёт Тогда
		Движение.СуммаДолга = ПодборГТД.Итог("Сумма");
		Отказ = ПроверкаРаспределения();
		
	Иначе		
		Движение.СуммаДолга = Сумма;
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ПроведениеПоРегиструТаможняОплатаГТД(Отказ)
	
	//Движения.ТаможняОплатаГТД.Записывать = Ложь;
	
	//регистр ТаможняОплатаГТД
	Для Каждого ТекСтрокаПодборГТД Из ПодборГТД Цикл
		
		Движение = Движения.ТаможняОплатаГТД.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ГТД = ТекСтрокаПодборГТД.ГТД;
		Движение.ПодИнвойсНомер = ТекСтрокаПодборГТД.ПодИнвойсНомер;
		Движение.Сумма = ТекСтрокаПодборГТД.Сумма;
		Движение.ТипДвижения = "Оплата машин";
		
	КонецЦикла;
	
	//Движения.ТаможняОплатаГТД.Записать();
	Движения.ТаможняОплатаГТД.Записать();
	
	//Проверка остатков
	Если НЕ ПроверкаОстатка() Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;	
	
КонецПроцедуры
///////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////


////Дима 05.07.2019 12:59:02////Заполнение из данных основания
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
	  ДанныеЗаполнения.Вставить("ВалютаОплаты", ДанныеЗаполнения.СчетОрганизации.Валюта);
	КонецЕсли;  
	
КонецПроцедуры	
//конец Дима

////Дима 16.03.2015 10:08:48////Если проходит оплата зарубежному контрагенту, то добавляем "СчетКонтрагенты" в обязательные для заполнения реквизиты.
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Контрагент.ВалютныйРассчёт Тогда
		ПроверяемыеРеквизиты.Добавить("СчетКонтрагента");
		ПроверяемыеРеквизиты.Добавить("ДоговорыКонтрагентов");
	КонецЕсли;
	
	Если Боркин.Количество() > 0 Тогда
		ПроверяемыеРеквизиты.Добавить("Боркин.Организация");
		ПроверяемыеРеквизиты.Добавить("Боркин.СчетОрганизации");
		ПроверяемыеРеквизиты.Добавить("Боркин.Контрагент");
		ПроверяемыеРеквизиты.Добавить("Боркин.ДатаПрихода");
		ПроверяемыеРеквизиты.Добавить("Боркин.Сумма");
	КонецЕсли;	
	
	
	ТЗ = УправлениеСвойствамиСлужебный.ПолучитьНаборыСвойствОбъекта(Контрагент);	
КонецПроцедуры	
//конец Дима

////Дима 01.05.2015 18:08:37////Если документ создаётся копированием, то очистим табличную часть Полдбор ГТД
Процедура ПриКопировании(ОбъектКопирования)
	ПодборГТД.Очистить();
	Сумма = 0;
	ДатаСрезаИнвойсов = Неопределено;
КонецПроцедуры
//конец Дима

////Дима 24.07.2015 10:34:32////Проверка остатков регистра при проведении
Функция ПроверкаОстатка()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаможняОплатаГТДОстатки.ГТД,
	               |	ТаможняОплатаГТДОстатки.СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ТаможняОплатаГТД.Остатки(&ДатаСреза, ГТД В (&СписокГТД)) КАК ТаможняОплатаГТДОстатки";
				   
				   
	Запрос.УстановитьПараметр("ДатаСреза", КонецДня(ДатаСрезаИнвойсов));			   
	Запрос.УстановитьПараметр("СписокГТД", ПодборГТД.ВыгрузитьКолонку("ГТД"));
				   
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из Результат Цикл
		
		Если строка.СуммаОстаток < 0 Тогда
			
			Индекс = ПодборГТД.Индекс(ПодборГТД.Найти(строка.ГТД, "ГТД"));
			ОбщийМодульСервер.ДобавитьСоообщениеВмассив(ЭтотОбъект, "Не хватает суммы ГТД!!!",, "ПодборГТД[" + Индекс + "].ГТД");
			возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	возврат Истина;
	
	
КонецФункции
//конец Дима

////Дима 10.08.2015 12:09:05////ПроверкаРаспределения
Функция ПроверкаРаспределения()

	Если Сумма <> ПодборГТД.Итог("СуммаВалютаОплаты") Тогда
		ОбщийМодульСервер.ДобавитьСоообщениеВмассив(, "Сумма оплаты нераспределена!!!");
		возврат Истина;
	КонецЕсли;
	
	возврат Ложь;

КонецФункции
//конец Дима
